class Solarch < Formula
  desc "TypeScript backend-as-a-service with SQLite, auth, realtime, and admin UI"
  homepage "https://github.com/Jay-Suryawansh7/Solarch"
  url "https://registry.npmjs.org/solarch/-/solarch-0.15.2.tgz"
  sha256 "f5a7fc332385644926fee10b6f049c57fb523f85203e82f58340b6d725a98a34"
  license "Apache-2.0"

  depends_on "node"

  def install
    system "npm", "install", *std_npm_args(keep_bin: true)
    bin.install_symlink Dir["#{libexec}/bin/*"]
  end

  def caveats
    <<~EOS
      ███████╗ ██████╗ ██╗      █████╗ ██████╗  ██████╗██╗  ██╗
      ██╔════╝██╔═══██╗██║     ██╔══██╗██╔══██╗██╔════╝██║  ██║
      ███████╗██║   ██║██║     ███████║██████╔╝██║     ███████║
      ╚════██║██║   ██║██║     ██╔══██║██╔══██╗██║     ██╔══██║
      ███████║╚██████╔╝███████╗██║  ██║██║  ██║╚██████╗██║  ██║
      ╚══════╝ ╚═════╝ ╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝

      v0.15.2 installed  ·  run: solarch serve --dir ./data
    EOS
  end

  test do
    system "#{bin}/solarch", "--version"
  end
end
